# 这个是用来研究地理信息怎么建模的。确切地说，高精地图和地形地物怎么转化成大模型容易理解的形式。
# 调研一下，不要再自己创了，有标准的就用标准的，哪怕是美军的也行。
import os.path
import sys
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '..')))

class gis():
    # 当前设想是，专门整一个东西来处理地理信息，试试以一定程度上结构化数据的方式把地理信息传给大模型，看看它的理解效果如何。
    def __init__(self):
        self.gis_type_dict= {} # 这个是存各种地形地物的描述的，
        self.gis_type_dict["河流"] = "河流能阻碍地面单位，不影响空中单位和火力打击。由多个坐标点的连线表示，第一个点为影响通过的河段起点，最后一个为影响交通的河段终点，认为坐标点之间河道较直。"
        self.gis_type_dict["桥梁"] = "桥梁在影响交通的河段上，能通过地面单位。由一个坐标点表示。"
        self.gis_type_dict["建筑物"] = "建筑物在陆地上，步兵可以进入其中。由一个坐标点表示。"
        self.gis_type_dict["道路"] = "道路能加速地面部队移动，不影响空中单位和火力打击，地面单位可以从道路任意位置上下道路。由多个坐标点的连线表示，认为坐标点之间道路较直。"

        self.gis_data_dict = {} 

    def set_gis_ldjs2024(self):
        self.gis_data_dict["建筑物1"] = {"坐标":[100.116,13.643]}
        self.gis_data_dict["建筑物2"] = {"坐标":[100.137,13.644]}
        self.gis_data_dict["建筑物3"] = {"坐标":[100.164,13.658]}
        
        # 从左到右从下到上了，
        self.gis_data_dict["桥梁1"] = {"坐标":[100.141,13.607]}
        self.gis_data_dict["桥梁2"] = {"坐标":[100.162,13.610]}
        self.gis_data_dict["桥梁3"] = {"坐标":[100.170,13.6227]}
        self.gis_data_dict["桥梁4"] = {"坐标":[100.116,13.6421]}
        self.gis_data_dict["桥梁5"] = {"坐标":[100.140,13.6433]}

        # 河流也是从左到右从下到上。
        self.gis_data_dict["河流1"] = {"坐标":[[100.131,13.6021],[100.161,13.6177],[100.194,13.6351]]}
        self.gis_data_dict["河流2"] = {"坐标":[[100.161,13.6177],[100.163,13.6015]]}
        self.gis_data_dict["河流3"] = {"坐标":[[100.103,13.6719],[100.116,13.643],[100.122,13.6287]]}
        self.gis_data_dict["河流4"] = {"坐标":[[100.130,13.6663],[100.140,13.6433],[100.141,13.635]]}

        # 道路标几条来看看成色，至少桥梁附近要有道路的吧
        self.gis_data_dict["道路1"] = {"坐标":[[100.141,13.607],[100.133,13.6423],[100.125,13.6617]]}
        self.gis_data_dict["道路2"] = {"坐标":[[100.154,13.6064],[100.162,13.610],[100.185,13.6258]]}
        self.gis_data_dict["道路3"] = {"坐标":[[100.116,13.6421],[100.133,13.6423],[100.140,13.6433],[100.164,13.657]]}



    def get_gis_str(self):
        # 转化成字符串形式到时候弄到提示词里面去。
        pass

if __name__ == '__main__':
    # 这里应该是组装一个提示词喂到大模型里面去，看看它能不能正确理解通过性，因为这个通过性其实带点逻辑特征在里面的。
    gis = gis()
    gis.set_gis_ldjs2024()
    print(gis.gis_data_dict)